GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
// Register: C1BDIAG1U
#define C1BDIAG1U C1BDIAG1U
C1BDIAG1U                                equ 013Eh
// bitfield definitions
C1BDIAG1U_NBIT0ERR_POSN                  equ 0000h
C1BDIAG1U_NBIT0ERR_POSITION              equ 0000h
C1BDIAG1U_NBIT0ERR_SIZE                  equ 0001h
C1BDIAG1U_NBIT0ERR_LENGTH                equ 0001h
C1BDIAG1U_NBIT0ERR_MASK                  equ 0001h
C1BDIAG1U_NBIT1ERR_POSN                  equ 0001h
C1BDIAG1U_NBIT1ERR_POSITION              equ 0001h
C1BDIAG1U_NBIT1ERR_SIZE                  equ 0001h
C1BDIAG1U_NBIT1ERR_LENGTH                equ 0001h
C1BDIAG1U_NBIT1ERR_MASK                  equ 0002h
C1BDIAG1U_NACKERR_POSN                   equ 0002h
C1BDIAG1U_NACKERR_POSITION               equ 0002h
C1BDIAG1U_NACKERR_SIZE                   equ 0001h
C1BDIAG1U_NACKERR_LENGTH                 equ 0001h
C1BDIAG1U_NACKERR_MASK                   equ 0004h
C1BDIAG1U_NFORMERR_POSN                  equ 0003h
C1BDIAG1U_NFORMERR_POSITION              equ 0003h
C1BDIAG1U_NFORMERR_SIZE                  equ 0001h
C1BDIAG1U_NFORMERR_LENGTH                equ 0001h
C1BDIAG1U_NFORMERR_MASK                  equ 0008h
C1BDIAG1U_NSTUFERR_POSN                  equ 0004h
C1BDIAG1U_NSTUFERR_POSITION              equ 0004h
C1BDIAG1U_NSTUFERR_SIZE                  equ 0001h
C1BDIAG1U_NSTUFERR_LENGTH                equ 0001h
C1BDIAG1U_NSTUFERR_MASK                  equ 0010h
C1BDIAG1U_NCRCERR_POSN                   equ 0005h
C1BDIAG1U_NCRCERR_POSITION               equ 0005h
C1BDIAG1U_NCRCERR_SIZE                   equ 0001h
C1BDIAG1U_NCRCERR_LENGTH                 equ 0001h
C1BDIAG1U_NCRCERR_MASK                   equ 0020h
C1BDIAG1U_TXBOERR_POSN                   equ 0007h
C1BDIAG1U_TXBOERR_POSITION               equ 0007h
C1BDIAG1U_TXBOERR_SIZE                   equ 0001h
C1BDIAG1U_TXBOERR_LENGTH                 equ 0001h
C1BDIAG1U_TXBOERR_MASK                   equ 0080h

// Register: C1BDIAG1T
#define C1BDIAG1T C1BDIAG1T
C1BDIAG1T                                equ 013Fh
// bitfield definitions
C1BDIAG1T_DCRCERR_POSN                   equ 0005h
C1BDIAG1T_DCRCERR_POSITION               equ 0005h
C1BDIAG1T_DCRCERR_SIZE                   equ 0001h
C1BDIAG1T_DCRCERR_LENGTH                 equ 0001h
C1BDIAG1T_DCRCERR_MASK                   equ 0020h
C1BDIAG1T_ESI_POSN                       equ 0006h
C1BDIAG1T_ESI_POSITION                   equ 0006h
C1BDIAG1T_ESI_SIZE                       equ 0001h
C1BDIAG1T_ESI_LENGTH                     equ 0001h
C1BDIAG1T_ESI_MASK                       equ 0040h

// Register: C1TEFCONL
#define C1TEFCONL C1TEFCONL
C1TEFCONL                                equ 0140h
// bitfield definitions
C1TEFCONL_TEFNEIE_POSN                   equ 0000h
C1TEFCONL_TEFNEIE_POSITION               equ 0000h
C1TEFCONL_TEFNEIE_SIZE                   equ 0001h
C1TEFCONL_TEFNEIE_LENGTH                 equ 0001h
C1TEFCONL_TEFNEIE_MASK                   equ 0001h
C1TEFCONL_TEFHIE_POSN                    equ 0001h
C1TEFCONL_TEFHIE_POSITION                equ 0001h
C1TEFCONL_TEFHIE_SIZE                    equ 0001h
C1TEFCONL_TEFHIE_LENGTH                  equ 0001h
C1TEFCONL_TEFHIE_MASK                    equ 0002h
C1TEFCONL_TEFFIE_POSN                    equ 0002h
C1TEFCONL_TEFFIE_POSITION                equ 0002h
C1TEFCONL_TEFFIE_SIZE                    equ 0001h
C1TEFCONL_TEFFIE_LENGTH                  equ 0001h
C1TEFCONL_TEFFIE_MASK                    equ 0004h
C1TEFCONL_TEFOVIE_POSN                   equ 0003h
C1TEFCONL_TEFOVIE_POSITION               equ 0003h
C1TEFCONL_TEFOVIE_SIZE                   equ 0001h
C1TEFCONL_TEFOVIE_LENGTH                 equ 0001h
C1TEFCONL_TEFOVIE_MASK                   equ 0008h
C1TEFCONL_TEFTSEN_POSN                   equ 0005h
C1TEFCONL_TEFTSEN_POSITION               equ 0005h
C1TEFCONL_TEFTSEN_SIZE                   equ 0001h
C1TEFCONL_TEFTSEN_LENGTH                 equ 0001h
C1TEFCONL_TEFTSEN_MASK                   equ 0020h

// Register: C1TEFCONH
#define C1TEFCONH C1TEFCONH
C1TEFCONH                                equ 0141h
// bitfield definitions
C1TEFCONH_UINC_POSN                      equ 0000h
C1TEFCONH_UINC_POSITION                  equ 0000h
C1TEFCONH_UINC_SIZE                      equ 0001h
C1TEFCONH_UINC_LENGTH                    equ 0001h
C1TEFCONH_UINC_MASK                      equ 0001h
C1TEFCONH_FRESET_POSN                    equ 0002h
C1TEFCONH_FRESET_POSITION                equ 0002h
C1TEFCONH_FRESET_SIZE                    equ 0001h
C1TEFCONH_FRESET_LENGTH                  equ 0001h
C1TEFCONH_FRESET_MASK                    equ 0004h

// Register: C1TEFCONU
#define C1TEFCONU C1TEFCONU
C1TEFCONU                                equ 0142h

// Register: C1TEFCONT
#define C1TEFCONT C1TEFCONT
C1TEFCONT                                equ 0143h
// bitfield definitions
C1TEFCONT_FSIZE_POSN                     equ 0000h
C1TEFCONT_FSIZE_POSITION                 equ 0000h
C1TEFCONT_FSIZE_SIZE                     equ 0005h
C1TEFCONT_FSIZE_LENGTH                   equ 0005h
C1TEFCONT_FSIZE_MASK                     equ 001Fh
C1TEFCONT_FSIZE0_POSN                    equ 0000h
C1TEFCONT_FSIZE0_POSITION                equ 0000h
C1TEFCONT_FSIZE0_SIZE                    equ 0001h
C1TEFCONT_FSIZE0_LENGTH                  equ 0001h
C1TEFCONT_FSIZE0_MASK                    equ 0001h
C1TEFCONT_FSIZE1_POSN                    equ 0001h
C1TEFCONT_FSIZE1_POSITION                equ 0001h
C1TEFCONT_FSIZE1_SIZE                    equ 0001h
C1TEFCONT_FSIZE1_LENGTH                  equ 0001h
C1TEFCONT_FSIZE1_MASK                    equ 0002h
C1TEFCONT_FSIZE2_POSN                    equ 0002h
C1TEFCONT_FSIZE2_POSITION                equ 0002h
C1TEFCONT_FSIZE2_SIZE                    equ 0001h
C1TEFCONT_FSIZE2_LENGTH                  equ 0001h
C1TEFCONT_FSIZE2_MASK                    equ 0004h
C1TEFCONT_FSIZE3_POSN                    equ 0003h
C1TEFCONT_FSIZE3_POSITION                equ 0003h
C1TEFCONT_FSIZE3_SIZE                    equ 0001h
C1TEFCONT_FSIZE3_LENGTH                  equ 0001h
C1TEFCONT_FSIZE3_MASK                    equ 0008h
C1TEFCONT_FSIZE4_POSN                    equ 0004h
C1TEFCONT_FSIZE4_POSITION                equ 0004h
C1TEFCONT_FSIZE4_SIZE                    equ 0001h
C1TEFCONT_FSIZE4_LENGTH                  equ 0001h
C1TEFCONT_FSIZE4_MASK                    equ 0010h

// Register: C1TEFSTAL
#define C1TEFSTAL C1TEFSTAL
C1TEFSTAL                                equ 0144h
// bitfield definitions
C1TEFSTAL_TEFNEIF_POSN                   equ 0000h
C1TEFSTAL_TEFNEIF_POSITION               equ 0000h
C1TEFSTAL_TEFNEIF_SIZE                   equ 0001h
C1TEFSTAL_TEFNEIF_LENGTH                 equ 0001h
C1TEFSTAL_TEFNEIF_MASK                   equ 0001h
C1TEFSTAL_TEFHIF_POSN                    equ 0001h
C1TEFSTAL_TEFHIF_POSITION                equ 0001h
C1TEFSTAL_TEFHIF_SIZE                    equ 0001h
C1TEFSTAL_TEFHIF_LENGTH                  equ 0001h
C1TEFSTAL_TEFHIF_MASK                    equ 0002h
C1TEFSTAL_TEFFIF_POSN                    equ 0002h
C1TEFSTAL_TEFFIF_POSITION                equ 0002h
C1TEFSTAL_TEFFIF_SIZE                    equ 0001h
C1TEFSTAL_TEFFIF_LENGTH                  equ 0001h
C1TEFSTAL_TEFFIF_MASK                    equ 0004h
C1TEFSTAL_TEFOVIF_POSN                   equ 0003h
C1TEFSTAL_TEFOVIF_POSITION               equ 0003h
C1TEFSTAL_TEFOVIF_SIZE                   equ 0001h
C1TEFSTAL_TEFOVIF_LENGTH                 equ 0001h
C1TEFSTAL_TEFOVIF_MASK                   equ 0008h

// Register: C1TEFSTAH
#define C1TEFSTAH C1TEFSTAH
C1TEFSTAH                                equ 0145h

// Register: C1TEFSTAU
#define C1TEFSTAU C1TEFSTAU
C1TEFSTAU                                equ 0146h

// Register: C1TEFSTAT
#define C1TEFSTAT C1TEFSTAT
C1TEFSTAT                                equ 0147h

// Register: C1TEFUA
#define C1TEFUA C1TEFUA
C1TEFUA                                  equ 0148h

// Register: C1TEFUAL
#define C1TEFUAL C1TEFUAL
C1TEFUAL                                 equ 0148h
// bitfield definitions
C1TEFUAL_TEFUA_POSN                      equ 0000h
C1TEFUAL_TEFUA_POSITION                  equ 0000h
C1TEFUAL_TEFUA_SIZE                      equ 0008h
C1TEFUAL_TEFUA_LENGTH                    equ 0008h
C1TEFUAL_TEFUA_MASK                      equ 00FFh
C1TEFUAL_TEFUA0_POSN                     equ 0000h
C1TEFUAL_TEFUA0_POSITION                 equ 0000h
C1TEFUAL_TEFUA0_SIZE                     equ 0001h
C1TEFUAL_TEFUA0_LENGTH                   equ 0001h
C1TEFUAL_TEFUA0_MASK                     equ 0001h
C1TEFUAL_TEFUA1_POSN                     equ 0001h
C1TEFUAL_TEFUA1_POSITION                 equ 0001h
C1TEFUAL_TEFUA1_SIZE                     equ 0001h
C1TEFUAL_TEFUA1_LENGTH                   equ 0001h
C1TEFUAL_TEFUA1_MASK                     equ 0002h
C1TEFUAL_TEFUA2_POSN                     equ 0002h
C1TEFUAL_TEFUA2_POSITION                 equ 0002h
C1TEFUAL_TEFUA2_SIZE                     equ 0001h
C1TEFUAL_TEFUA2_LENGTH                   equ 0001h
C1TEFUAL_TEFUA2_MASK                     equ 0004h
C1TEFUAL_TEFUA3_POSN                     equ 0003h
C1TEFUAL_TEFUA3_POSITION                 equ 0003h
C1TEFUAL_TEFUA3_SIZE                     equ 0001h
C1TEFUAL_TEFUA3_LENGTH                   equ 0001h
C1TEFUAL_TEFUA3_MASK                     equ 0008h
C1TEFUAL_TEFUA4_POSN                     equ 0004h
C1TEFUAL_TEFUA4_POSITION                 equ 0004h
C1TEFUAL_TEFUA4_SIZE                     equ 0001h
C1TEFUAL_TEFUA4_LENGTH                   equ 0001h
C1TEFUAL_TEFUA4_MASK                     equ 0010h
C1TEFUAL_TEFUA5_POSN                     equ 0005h
C1TEFUAL_TEFUA5_POSITION                 equ 0005h
C1TEFUAL_TEFUA5_SIZE                     equ 0001h
C1TEFUAL_TEFUA5_LENGTH                   equ 0001h
C1TEFUAL_TEFUA5_MASK                     equ 0020h
C1TEFUAL_TEFUA6_POSN                     equ 0006h
C1TEFUAL_TEFUA6_POSITION                 equ 0006h
C1TEFUAL_TEFUA6_SIZE                     equ 0001h
C1TEFUAL_TEFUA6_LENGTH                   equ 0001h
C1TEFUAL_TEFUA6_MASK                     equ 0040h
C1TEFUAL_TEFUA7_POSN                     equ 0007h
C1TEFUAL_TEFUA7_POSITION                 equ 0007h
C1TEFUAL_TEFUA7_SIZE                     equ 0001h
C1TEFUAL_TEFUA7_LENGTH                   equ 0001h
C1TEFUAL_TEFUA7_MASK                     equ 0080h

