GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
// Register: C1FIFOBA
#define C1FIFOBA C1FIFOBA
C1FIFOBA                                 equ 014Ch

// Register: C1FIFOBAL
#define C1FIFOBAL C1FIFOBAL
C1FIFOBAL                                equ 014Ch
// bitfield definitions
C1FIFOBAL_FIFOBA_POSN                    equ 0000h
C1FIFOBAL_FIFOBA_POSITION                equ 0000h
C1FIFOBAL_FIFOBA_SIZE                    equ 0008h
C1FIFOBAL_FIFOBA_LENGTH                  equ 0008h
C1FIFOBAL_FIFOBA_MASK                    equ 00FFh
C1FIFOBAL_FIFOBA0_POSN                   equ 0000h
C1FIFOBAL_FIFOBA0_POSITION               equ 0000h
C1FIFOBAL_FIFOBA0_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA0_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA0_MASK                   equ 0001h
C1FIFOBAL_FIFOBA1_POSN                   equ 0001h
C1FIFOBAL_FIFOBA1_POSITION               equ 0001h
C1FIFOBAL_FIFOBA1_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA1_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA1_MASK                   equ 0002h
C1FIFOBAL_FIFOBA2_POSN                   equ 0002h
C1FIFOBAL_FIFOBA2_POSITION               equ 0002h
C1FIFOBAL_FIFOBA2_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA2_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA2_MASK                   equ 0004h
C1FIFOBAL_FIFOBA3_POSN                   equ 0003h
C1FIFOBAL_FIFOBA3_POSITION               equ 0003h
C1FIFOBAL_FIFOBA3_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA3_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA3_MASK                   equ 0008h
C1FIFOBAL_FIFOBA4_POSN                   equ 0004h
C1FIFOBAL_FIFOBA4_POSITION               equ 0004h
C1FIFOBAL_FIFOBA4_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA4_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA4_MASK                   equ 0010h
C1FIFOBAL_FIFOBA5_POSN                   equ 0005h
C1FIFOBAL_FIFOBA5_POSITION               equ 0005h
C1FIFOBAL_FIFOBA5_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA5_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA5_MASK                   equ 0020h
C1FIFOBAL_FIFOBA6_POSN                   equ 0006h
C1FIFOBAL_FIFOBA6_POSITION               equ 0006h
C1FIFOBAL_FIFOBA6_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA6_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA6_MASK                   equ 0040h
C1FIFOBAL_FIFOBA7_POSN                   equ 0007h
C1FIFOBAL_FIFOBA7_POSITION               equ 0007h
C1FIFOBAL_FIFOBA7_SIZE                   equ 0001h
C1FIFOBAL_FIFOBA7_LENGTH                 equ 0001h
C1FIFOBAL_FIFOBA7_MASK                   equ 0080h

// Register: C1FIFOBAH
#define C1FIFOBAH C1FIFOBAH
C1FIFOBAH                                equ 014Dh
// bitfield definitions
C1FIFOBAH_FIFOBA_POSN                    equ 0000h
C1FIFOBAH_FIFOBA_POSITION                equ 0000h
C1FIFOBAH_FIFOBA_SIZE                    equ 0008h
C1FIFOBAH_FIFOBA_LENGTH                  equ 0008h
C1FIFOBAH_FIFOBA_MASK                    equ 00FFh
C1FIFOBAH_FIFOBA8_POSN                   equ 0000h
C1FIFOBAH_FIFOBA8_POSITION               equ 0000h
C1FIFOBAH_FIFOBA8_SIZE                   equ 0001h
C1FIFOBAH_FIFOBA8_LENGTH                 equ 0001h
C1FIFOBAH_FIFOBA8_MASK                   equ 0001h
C1FIFOBAH_FIFOBA9_POSN                   equ 0001h
C1FIFOBAH_FIFOBA9_POSITION               equ 0001h
C1FIFOBAH_FIFOBA9_SIZE                   equ 0001h
C1FIFOBAH_FIFOBA9_LENGTH                 equ 0001h
C1FIFOBAH_FIFOBA9_MASK                   equ 0002h
C1FIFOBAH_FIFOBA10_POSN                  equ 0002h
C1FIFOBAH_FIFOBA10_POSITION              equ 0002h
C1FIFOBAH_FIFOBA10_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA10_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA10_MASK                  equ 0004h
C1FIFOBAH_FIFOBA11_POSN                  equ 0003h
C1FIFOBAH_FIFOBA11_POSITION              equ 0003h
C1FIFOBAH_FIFOBA11_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA11_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA11_MASK                  equ 0008h
C1FIFOBAH_FIFOBA12_POSN                  equ 0004h
C1FIFOBAH_FIFOBA12_POSITION              equ 0004h
C1FIFOBAH_FIFOBA12_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA12_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA12_MASK                  equ 0010h
C1FIFOBAH_FIFOBA13_POSN                  equ 0005h
C1FIFOBAH_FIFOBA13_POSITION              equ 0005h
C1FIFOBAH_FIFOBA13_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA13_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA13_MASK                  equ 0020h
C1FIFOBAH_FIFOBA14_POSN                  equ 0006h
C1FIFOBAH_FIFOBA14_POSITION              equ 0006h
C1FIFOBAH_FIFOBA14_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA14_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA14_MASK                  equ 0040h
C1FIFOBAH_FIFOBA15_POSN                  equ 0007h
C1FIFOBAH_FIFOBA15_POSITION              equ 0007h
C1FIFOBAH_FIFOBA15_SIZE                  equ 0001h
C1FIFOBAH_FIFOBA15_LENGTH                equ 0001h
C1FIFOBAH_FIFOBA15_MASK                  equ 0080h

// Register: C1FIFOBAU
#define C1FIFOBAU C1FIFOBAU
C1FIFOBAU                                equ 014Eh
// bitfield definitions
C1FIFOBAU_FIFOBA_POSN                    equ 0000h
C1FIFOBAU_FIFOBA_POSITION                equ 0000h
C1FIFOBAU_FIFOBA_SIZE                    equ 0008h
C1FIFOBAU_FIFOBA_LENGTH                  equ 0008h
C1FIFOBAU_FIFOBA_MASK                    equ 00FFh
C1FIFOBAU_FIFOBA16_POSN                  equ 0000h
C1FIFOBAU_FIFOBA16_POSITION              equ 0000h
C1FIFOBAU_FIFOBA16_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA16_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA16_MASK                  equ 0001h
C1FIFOBAU_FIFOBA17_POSN                  equ 0001h
C1FIFOBAU_FIFOBA17_POSITION              equ 0001h
C1FIFOBAU_FIFOBA17_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA17_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA17_MASK                  equ 0002h
C1FIFOBAU_FIFOBA18_POSN                  equ 0002h
C1FIFOBAU_FIFOBA18_POSITION              equ 0002h
C1FIFOBAU_FIFOBA18_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA18_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA18_MASK                  equ 0004h
C1FIFOBAU_FIFOBA19_POSN                  equ 0003h
C1FIFOBAU_FIFOBA19_POSITION              equ 0003h
C1FIFOBAU_FIFOBA19_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA19_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA19_MASK                  equ 0008h
C1FIFOBAU_FIFOBA20_POSN                  equ 0004h
C1FIFOBAU_FIFOBA20_POSITION              equ 0004h
C1FIFOBAU_FIFOBA20_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA20_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA20_MASK                  equ 0010h
C1FIFOBAU_FIFOBA21_POSN                  equ 0005h
C1FIFOBAU_FIFOBA21_POSITION              equ 0005h
C1FIFOBAU_FIFOBA21_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA21_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA21_MASK                  equ 0020h
C1FIFOBAU_FIFOBA22_POSN                  equ 0006h
C1FIFOBAU_FIFOBA22_POSITION              equ 0006h
C1FIFOBAU_FIFOBA22_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA22_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA22_MASK                  equ 0040h
C1FIFOBAU_FIFOBA23_POSN                  equ 0007h
C1FIFOBAU_FIFOBA23_POSITION              equ 0007h
C1FIFOBAU_FIFOBA23_SIZE                  equ 0001h
C1FIFOBAU_FIFOBA23_LENGTH                equ 0001h
C1FIFOBAU_FIFOBA23_MASK                  equ 0080h

