GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
// Register: C1FIFOUA2T
#define C1FIFOUA2T C1FIFOUA2T
C1FIFOUA2T                               equ 0173h
// bitfield definitions
C1FIFOUA2T_FIFOUA_POSN                   equ 0000h
C1FIFOUA2T_FIFOUA_POSITION               equ 0000h
C1FIFOUA2T_FIFOUA_SIZE                   equ 0008h
C1FIFOUA2T_FIFOUA_LENGTH                 equ 0008h
C1FIFOUA2T_FIFOUA_MASK                   equ 00FFh
C1FIFOUA2T_FIFOUA24_POSN                 equ 0000h
C1FIFOUA2T_FIFOUA24_POSITION             equ 0000h
C1FIFOUA2T_FIFOUA24_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA24_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA24_MASK                 equ 0001h
C1FIFOUA2T_FIFOUA25_POSN                 equ 0001h
C1FIFOUA2T_FIFOUA25_POSITION             equ 0001h
C1FIFOUA2T_FIFOUA25_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA25_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA25_MASK                 equ 0002h
C1FIFOUA2T_FIFOUA26_POSN                 equ 0002h
C1FIFOUA2T_FIFOUA26_POSITION             equ 0002h
C1FIFOUA2T_FIFOUA26_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA26_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA26_MASK                 equ 0004h
C1FIFOUA2T_FIFOUA27_POSN                 equ 0003h
C1FIFOUA2T_FIFOUA27_POSITION             equ 0003h
C1FIFOUA2T_FIFOUA27_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA27_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA27_MASK                 equ 0008h
C1FIFOUA2T_FIFOUA28_POSN                 equ 0004h
C1FIFOUA2T_FIFOUA28_POSITION             equ 0004h
C1FIFOUA2T_FIFOUA28_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA28_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA28_MASK                 equ 0010h
C1FIFOUA2T_FIFOUA29_POSN                 equ 0005h
C1FIFOUA2T_FIFOUA29_POSITION             equ 0005h
C1FIFOUA2T_FIFOUA29_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA29_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA29_MASK                 equ 0020h
C1FIFOUA2T_FIFOUA30_POSN                 equ 0006h
C1FIFOUA2T_FIFOUA30_POSITION             equ 0006h
C1FIFOUA2T_FIFOUA30_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA30_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA30_MASK                 equ 0040h
C1FIFOUA2T_FIFOUA31_POSN                 equ 0007h
C1FIFOUA2T_FIFOUA31_POSITION             equ 0007h
C1FIFOUA2T_FIFOUA31_SIZE                 equ 0001h
C1FIFOUA2T_FIFOUA31_LENGTH               equ 0001h
C1FIFOUA2T_FIFOUA31_MASK                 equ 0080h

// Register: C1FIFOCON3
#define C1FIFOCON3 C1FIFOCON3
C1FIFOCON3                               equ 0174h

// Register: C1FIFOCON3L
#define C1FIFOCON3L C1FIFOCON3L
C1FIFOCON3L                              equ 0174h
// bitfield definitions
C1FIFOCON3L_TFNRFNIE_POSN                equ 0000h
C1FIFOCON3L_TFNRFNIE_POSITION            equ 0000h
C1FIFOCON3L_TFNRFNIE_SIZE                equ 0001h
C1FIFOCON3L_TFNRFNIE_LENGTH              equ 0001h
C1FIFOCON3L_TFNRFNIE_MASK                equ 0001h
C1FIFOCON3L_TFHRFHIE_POSN                equ 0001h
C1FIFOCON3L_TFHRFHIE_POSITION            equ 0001h
C1FIFOCON3L_TFHRFHIE_SIZE                equ 0001h
C1FIFOCON3L_TFHRFHIE_LENGTH              equ 0001h
C1FIFOCON3L_TFHRFHIE_MASK                equ 0002h
C1FIFOCON3L_TFERFFIE_POSN                equ 0002h
C1FIFOCON3L_TFERFFIE_POSITION            equ 0002h
C1FIFOCON3L_TFERFFIE_SIZE                equ 0001h
C1FIFOCON3L_TFERFFIE_LENGTH              equ 0001h
C1FIFOCON3L_TFERFFIE_MASK                equ 0004h
C1FIFOCON3L_RXOVIE_POSN                  equ 0003h
C1FIFOCON3L_RXOVIE_POSITION              equ 0003h
C1FIFOCON3L_RXOVIE_SIZE                  equ 0001h
C1FIFOCON3L_RXOVIE_LENGTH                equ 0001h
C1FIFOCON3L_RXOVIE_MASK                  equ 0008h
C1FIFOCON3L_TXATIE_POSN                  equ 0004h
C1FIFOCON3L_TXATIE_POSITION              equ 0004h
C1FIFOCON3L_TXATIE_SIZE                  equ 0001h
C1FIFOCON3L_TXATIE_LENGTH                equ 0001h
C1FIFOCON3L_TXATIE_MASK                  equ 0010h
C1FIFOCON3L_RXTSEN_POSN                  equ 0005h
C1FIFOCON3L_RXTSEN_POSITION              equ 0005h
C1FIFOCON3L_RXTSEN_SIZE                  equ 0001h
C1FIFOCON3L_RXTSEN_LENGTH                equ 0001h
C1FIFOCON3L_RXTSEN_MASK                  equ 0020h
C1FIFOCON3L_RTREN_POSN                   equ 0006h
C1FIFOCON3L_RTREN_POSITION               equ 0006h
C1FIFOCON3L_RTREN_SIZE                   equ 0001h
C1FIFOCON3L_RTREN_LENGTH                 equ 0001h
C1FIFOCON3L_RTREN_MASK                   equ 0040h
C1FIFOCON3L_TXEN_POSN                    equ 0007h
C1FIFOCON3L_TXEN_POSITION                equ 0007h
C1FIFOCON3L_TXEN_SIZE                    equ 0001h
C1FIFOCON3L_TXEN_LENGTH                  equ 0001h
C1FIFOCON3L_TXEN_MASK                    equ 0080h

// Register: C1FIFOCON3H
#define C1FIFOCON3H C1FIFOCON3H
C1FIFOCON3H                              equ 0175h
// bitfield definitions
C1FIFOCON3H_UINC_POSN                    equ 0000h
C1FIFOCON3H_UINC_POSITION                equ 0000h
C1FIFOCON3H_UINC_SIZE                    equ 0001h
C1FIFOCON3H_UINC_LENGTH                  equ 0001h
C1FIFOCON3H_UINC_MASK                    equ 0001h
C1FIFOCON3H_TXREQ_POSN                   equ 0001h
C1FIFOCON3H_TXREQ_POSITION               equ 0001h
C1FIFOCON3H_TXREQ_SIZE                   equ 0001h
C1FIFOCON3H_TXREQ_LENGTH                 equ 0001h
C1FIFOCON3H_TXREQ_MASK                   equ 0002h
C1FIFOCON3H_FRESET_POSN                  equ 0002h
C1FIFOCON3H_FRESET_POSITION              equ 0002h
C1FIFOCON3H_FRESET_SIZE                  equ 0001h
C1FIFOCON3H_FRESET_LENGTH                equ 0001h
C1FIFOCON3H_FRESET_MASK                  equ 0004h

// Register: C1FIFOCON3U
#define C1FIFOCON3U C1FIFOCON3U
C1FIFOCON3U                              equ 0176h
// bitfield definitions
C1FIFOCON3U_TXPRI_POSN                   equ 0000h
C1FIFOCON3U_TXPRI_POSITION               equ 0000h
C1FIFOCON3U_TXPRI_SIZE                   equ 0005h
C1FIFOCON3U_TXPRI_LENGTH                 equ 0005h
C1FIFOCON3U_TXPRI_MASK                   equ 001Fh
C1FIFOCON3U_TXAT_POSN                    equ 0005h
C1FIFOCON3U_TXAT_POSITION                equ 0005h
C1FIFOCON3U_TXAT_SIZE                    equ 0002h
C1FIFOCON3U_TXAT_LENGTH                  equ 0002h
C1FIFOCON3U_TXAT_MASK                    equ 0060h
C1FIFOCON3U_TXPRI0_POSN                  equ 0000h
C1FIFOCON3U_TXPRI0_POSITION              equ 0000h
C1FIFOCON3U_TXPRI0_SIZE                  equ 0001h
C1FIFOCON3U_TXPRI0_LENGTH                equ 0001h
C1FIFOCON3U_TXPRI0_MASK                  equ 0001h
C1FIFOCON3U_TXPRI1_POSN                  equ 0001h
C1FIFOCON3U_TXPRI1_POSITION              equ 0001h
C1FIFOCON3U_TXPRI1_SIZE                  equ 0001h
C1FIFOCON3U_TXPRI1_LENGTH                equ 0001h
C1FIFOCON3U_TXPRI1_MASK                  equ 0002h
C1FIFOCON3U_TXPRI2_POSN                  equ 0002h
C1FIFOCON3U_TXPRI2_POSITION              equ 0002h
C1FIFOCON3U_TXPRI2_SIZE                  equ 0001h
C1FIFOCON3U_TXPRI2_LENGTH                equ 0001h
C1FIFOCON3U_TXPRI2_MASK                  equ 0004h
C1FIFOCON3U_TXPRI3_POSN                  equ 0003h
C1FIFOCON3U_TXPRI3_POSITION              equ 0003h
C1FIFOCON3U_TXPRI3_SIZE                  equ 0001h
C1FIFOCON3U_TXPRI3_LENGTH                equ 0001h
C1FIFOCON3U_TXPRI3_MASK                  equ 0008h
C1FIFOCON3U_TXPRI4_POSN                  equ 0004h
C1FIFOCON3U_TXPRI4_POSITION              equ 0004h
C1FIFOCON3U_TXPRI4_SIZE                  equ 0001h
C1FIFOCON3U_TXPRI4_LENGTH                equ 0001h
C1FIFOCON3U_TXPRI4_MASK                  equ 0010h
C1FIFOCON3U_TXAT0_POSN                   equ 0005h
C1FIFOCON3U_TXAT0_POSITION               equ 0005h
C1FIFOCON3U_TXAT0_SIZE                   equ 0001h
C1FIFOCON3U_TXAT0_LENGTH                 equ 0001h
C1FIFOCON3U_TXAT0_MASK                   equ 0020h
C1FIFOCON3U_TXAT1_POSN                   equ 0006h
C1FIFOCON3U_TXAT1_POSITION               equ 0006h
C1FIFOCON3U_TXAT1_SIZE                   equ 0001h
C1FIFOCON3U_TXAT1_LENGTH                 equ 0001h
C1FIFOCON3U_TXAT1_MASK                   equ 0040h

