GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
// Register: TU16APS
#define TU16APS TU16APS
TU16APS                                  equ 038Ah
// bitfield definitions
TU16APS_PS_POSN                          equ 0000h
TU16APS_PS_POSITION                      equ 0000h
TU16APS_PS_SIZE                          equ 0008h
TU16APS_PS_LENGTH                        equ 0008h
TU16APS_PS_MASK                          equ 00FFh
TU16APS_PS0_POSN                         equ 0000h
TU16APS_PS0_POSITION                     equ 0000h
TU16APS_PS0_SIZE                         equ 0001h
TU16APS_PS0_LENGTH                       equ 0001h
TU16APS_PS0_MASK                         equ 0001h
TU16APS_PS1_POSN                         equ 0001h
TU16APS_PS1_POSITION                     equ 0001h
TU16APS_PS1_SIZE                         equ 0001h
TU16APS_PS1_LENGTH                       equ 0001h
TU16APS_PS1_MASK                         equ 0002h
TU16APS_PS2_POSN                         equ 0002h
TU16APS_PS2_POSITION                     equ 0002h
TU16APS_PS2_SIZE                         equ 0001h
TU16APS_PS2_LENGTH                       equ 0001h
TU16APS_PS2_MASK                         equ 0004h
TU16APS_PS3_POSN                         equ 0003h
TU16APS_PS3_POSITION                     equ 0003h
TU16APS_PS3_SIZE                         equ 0001h
TU16APS_PS3_LENGTH                       equ 0001h
TU16APS_PS3_MASK                         equ 0008h
TU16APS_PS4_POSN                         equ 0004h
TU16APS_PS4_POSITION                     equ 0004h
TU16APS_PS4_SIZE                         equ 0001h
TU16APS_PS4_LENGTH                       equ 0001h
TU16APS_PS4_MASK                         equ 0010h
TU16APS_PS5_POSN                         equ 0005h
TU16APS_PS5_POSITION                     equ 0005h
TU16APS_PS5_SIZE                         equ 0001h
TU16APS_PS5_LENGTH                       equ 0001h
TU16APS_PS5_MASK                         equ 0020h
TU16APS_PS6_POSN                         equ 0006h
TU16APS_PS6_POSITION                     equ 0006h
TU16APS_PS6_SIZE                         equ 0001h
TU16APS_PS6_LENGTH                       equ 0001h
TU16APS_PS6_MASK                         equ 0040h
TU16APS_PS7_POSN                         equ 0007h
TU16APS_PS7_POSITION                     equ 0007h
TU16APS_PS7_SIZE                         equ 0001h
TU16APS_PS7_LENGTH                       equ 0001h
TU16APS_PS7_MASK                         equ 0080h
TU16APS_TU16APS0_POSN                    equ 0000h
TU16APS_TU16APS0_POSITION                equ 0000h
TU16APS_TU16APS0_SIZE                    equ 0001h
TU16APS_TU16APS0_LENGTH                  equ 0001h
TU16APS_TU16APS0_MASK                    equ 0001h
TU16APS_TU16APS1_POSN                    equ 0001h
TU16APS_TU16APS1_POSITION                equ 0001h
TU16APS_TU16APS1_SIZE                    equ 0001h
TU16APS_TU16APS1_LENGTH                  equ 0001h
TU16APS_TU16APS1_MASK                    equ 0002h
TU16APS_TU16APS2_POSN                    equ 0002h
TU16APS_TU16APS2_POSITION                equ 0002h
TU16APS_TU16APS2_SIZE                    equ 0001h
TU16APS_TU16APS2_LENGTH                  equ 0001h
TU16APS_TU16APS2_MASK                    equ 0004h
TU16APS_TU16APS3_POSN                    equ 0003h
TU16APS_TU16APS3_POSITION                equ 0003h
TU16APS_TU16APS3_SIZE                    equ 0001h
TU16APS_TU16APS3_LENGTH                  equ 0001h
TU16APS_TU16APS3_MASK                    equ 0008h
TU16APS_TU16APS4_POSN                    equ 0004h
TU16APS_TU16APS4_POSITION                equ 0004h
TU16APS_TU16APS4_SIZE                    equ 0001h
TU16APS_TU16APS4_LENGTH                  equ 0001h
TU16APS_TU16APS4_MASK                    equ 0010h
TU16APS_TU16APS5_POSN                    equ 0005h
TU16APS_TU16APS5_POSITION                equ 0005h
TU16APS_TU16APS5_SIZE                    equ 0001h
TU16APS_TU16APS5_LENGTH                  equ 0001h
TU16APS_TU16APS5_MASK                    equ 0020h
TU16APS_TU16APS6_POSN                    equ 0006h
TU16APS_TU16APS6_POSITION                equ 0006h
TU16APS_TU16APS6_SIZE                    equ 0001h
TU16APS_TU16APS6_LENGTH                  equ 0001h
TU16APS_TU16APS6_MASK                    equ 0040h
TU16APS_TU16APS7_POSN                    equ 0007h
TU16APS_TU16APS7_POSITION                equ 0007h
TU16APS_TU16APS7_SIZE                    equ 0001h
TU16APS_TU16APS7_LENGTH                  equ 0001h
TU16APS_TU16APS7_MASK                    equ 0080h
TU16APS_TU16APS_POSN                     equ 0000h
TU16APS_TU16APS_POSITION                 equ 0000h
TU16APS_TU16APS_SIZE                     equ 0008h
TU16APS_TU16APS_LENGTH                   equ 0008h
TU16APS_TU16APS_MASK                     equ 00FFh

// Register: TU16ATMR
#define TU16ATMR TU16ATMR
TU16ATMR                                 equ 038Bh

// Register: TU16ATMRL
#define TU16ATMRL TU16ATMRL
TU16ATMRL                                equ 038Bh
// bitfield definitions
TU16ATMRL_TMRL_POSN                      equ 0000h
TU16ATMRL_TMRL_POSITION                  equ 0000h
TU16ATMRL_TMRL_SIZE                      equ 0008h
TU16ATMRL_TMRL_LENGTH                    equ 0008h
TU16ATMRL_TMRL_MASK                      equ 00FFh
TU16ATMRL_TMRL0_POSN                     equ 0000h
TU16ATMRL_TMRL0_POSITION                 equ 0000h
TU16ATMRL_TMRL0_SIZE                     equ 0001h
TU16ATMRL_TMRL0_LENGTH                   equ 0001h
TU16ATMRL_TMRL0_MASK                     equ 0001h
TU16ATMRL_TMRL1_POSN                     equ 0001h
TU16ATMRL_TMRL1_POSITION                 equ 0001h
TU16ATMRL_TMRL1_SIZE                     equ 0001h
TU16ATMRL_TMRL1_LENGTH                   equ 0001h
TU16ATMRL_TMRL1_MASK                     equ 0002h
TU16ATMRL_TMRL2_POSN                     equ 0002h
TU16ATMRL_TMRL2_POSITION                 equ 0002h
TU16ATMRL_TMRL2_SIZE                     equ 0001h
TU16ATMRL_TMRL2_LENGTH                   equ 0001h
TU16ATMRL_TMRL2_MASK                     equ 0004h
TU16ATMRL_TMRL3_POSN                     equ 0003h
TU16ATMRL_TMRL3_POSITION                 equ 0003h
TU16ATMRL_TMRL3_SIZE                     equ 0001h
TU16ATMRL_TMRL3_LENGTH                   equ 0001h
TU16ATMRL_TMRL3_MASK                     equ 0008h
TU16ATMRL_TMRL4_POSN                     equ 0004h
TU16ATMRL_TMRL4_POSITION                 equ 0004h
TU16ATMRL_TMRL4_SIZE                     equ 0001h
TU16ATMRL_TMRL4_LENGTH                   equ 0001h
TU16ATMRL_TMRL4_MASK                     equ 0010h
TU16ATMRL_TMRL5_POSN                     equ 0005h
TU16ATMRL_TMRL5_POSITION                 equ 0005h
TU16ATMRL_TMRL5_SIZE                     equ 0001h
TU16ATMRL_TMRL5_LENGTH                   equ 0001h
TU16ATMRL_TMRL5_MASK                     equ 0020h
TU16ATMRL_TMRL6_POSN                     equ 0006h
TU16ATMRL_TMRL6_POSITION                 equ 0006h
TU16ATMRL_TMRL6_SIZE                     equ 0001h
TU16ATMRL_TMRL6_LENGTH                   equ 0001h
TU16ATMRL_TMRL6_MASK                     equ 0040h
TU16ATMRL_TMRL7_POSN                     equ 0007h
TU16ATMRL_TMRL7_POSITION                 equ 0007h
TU16ATMRL_TMRL7_SIZE                     equ 0001h
TU16ATMRL_TMRL7_LENGTH                   equ 0001h
TU16ATMRL_TMRL7_MASK                     equ 0080h
TU16ATMRL_TU16ATMRL0_POSN                equ 0000h
TU16ATMRL_TU16ATMRL0_POSITION            equ 0000h
TU16ATMRL_TU16ATMRL0_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL0_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL0_MASK                equ 0001h
TU16ATMRL_TU16ATMRL1_POSN                equ 0001h
TU16ATMRL_TU16ATMRL1_POSITION            equ 0001h
TU16ATMRL_TU16ATMRL1_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL1_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL1_MASK                equ 0002h
TU16ATMRL_TU16ATMRL2_POSN                equ 0002h
TU16ATMRL_TU16ATMRL2_POSITION            equ 0002h
TU16ATMRL_TU16ATMRL2_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL2_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL2_MASK                equ 0004h
TU16ATMRL_TU16ATMRL3_POSN                equ 0003h
TU16ATMRL_TU16ATMRL3_POSITION            equ 0003h
TU16ATMRL_TU16ATMRL3_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL3_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL3_MASK                equ 0008h
TU16ATMRL_TU16ATMRL4_POSN                equ 0004h
TU16ATMRL_TU16ATMRL4_POSITION            equ 0004h
TU16ATMRL_TU16ATMRL4_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL4_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL4_MASK                equ 0010h
TU16ATMRL_TU16ATMRL5_POSN                equ 0005h
TU16ATMRL_TU16ATMRL5_POSITION            equ 0005h
TU16ATMRL_TU16ATMRL5_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL5_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL5_MASK                equ 0020h
TU16ATMRL_TU16ATMRL6_POSN                equ 0006h
TU16ATMRL_TU16ATMRL6_POSITION            equ 0006h
TU16ATMRL_TU16ATMRL6_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL6_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL6_MASK                equ 0040h
TU16ATMRL_TU16ATMRL7_POSN                equ 0007h
TU16ATMRL_TU16ATMRL7_POSITION            equ 0007h
TU16ATMRL_TU16ATMRL7_SIZE                equ 0001h
TU16ATMRL_TU16ATMRL7_LENGTH              equ 0001h
TU16ATMRL_TU16ATMRL7_MASK                equ 0080h
TU16ATMRL_TU16ATMR0_POSN                 equ 0000h
TU16ATMRL_TU16ATMR0_POSITION             equ 0000h
TU16ATMRL_TU16ATMR0_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR0_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR0_MASK                 equ 0001h
TU16ATMRL_TU16ATMR1_POSN                 equ 0001h
TU16ATMRL_TU16ATMR1_POSITION             equ 0001h
TU16ATMRL_TU16ATMR1_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR1_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR1_MASK                 equ 0002h
TU16ATMRL_TU16ATMR2_POSN                 equ 0002h
TU16ATMRL_TU16ATMR2_POSITION             equ 0002h
TU16ATMRL_TU16ATMR2_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR2_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR2_MASK                 equ 0004h
TU16ATMRL_TU16ATMR3_POSN                 equ 0003h
TU16ATMRL_TU16ATMR3_POSITION             equ 0003h
TU16ATMRL_TU16ATMR3_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR3_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR3_MASK                 equ 0008h
TU16ATMRL_TU16ATMR4_POSN                 equ 0004h
TU16ATMRL_TU16ATMR4_POSITION             equ 0004h
TU16ATMRL_TU16ATMR4_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR4_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR4_MASK                 equ 0010h
TU16ATMRL_TU16ATMR5_POSN                 equ 0005h
TU16ATMRL_TU16ATMR5_POSITION             equ 0005h
TU16ATMRL_TU16ATMR5_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR5_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR5_MASK                 equ 0020h
TU16ATMRL_TU16ATMR6_POSN                 equ 0006h
TU16ATMRL_TU16ATMR6_POSITION             equ 0006h
TU16ATMRL_TU16ATMR6_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR6_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR6_MASK                 equ 0040h
TU16ATMRL_TU16ATMR7_POSN                 equ 0007h
TU16ATMRL_TU16ATMR7_POSITION             equ 0007h
TU16ATMRL_TU16ATMR7_SIZE                 equ 0001h
TU16ATMRL_TU16ATMR7_LENGTH               equ 0001h
TU16ATMRL_TU16ATMR7_MASK                 equ 0080h

// Register: TU16ACRL
#define TU16ACRL TU16ACRL
TU16ACRL                                 equ 038Bh
// bitfield definitions
TU16ACRL_CRL_POSN                        equ 0000h
TU16ACRL_CRL_POSITION                    equ 0000h
TU16ACRL_CRL_SIZE                        equ 0008h
TU16ACRL_CRL_LENGTH                      equ 0008h
TU16ACRL_CRL_MASK                        equ 00FFh
TU16ACRL_CRL0_POSN                       equ 0000h
TU16ACRL_CRL0_POSITION                   equ 0000h
TU16ACRL_CRL0_SIZE                       equ 0001h
TU16ACRL_CRL0_LENGTH                     equ 0001h
TU16ACRL_CRL0_MASK                       equ 0001h
TU16ACRL_CRL1_POSN                       equ 0001h
TU16ACRL_CRL1_POSITION                   equ 0001h
TU16ACRL_CRL1_SIZE                       equ 0001h
TU16ACRL_CRL1_LENGTH                     equ 0001h
TU16ACRL_CRL1_MASK                       equ 0002h
TU16ACRL_CRL2_POSN                       equ 0002h
TU16ACRL_CRL2_POSITION                   equ 0002h
TU16ACRL_CRL2_SIZE                       equ 0001h
TU16ACRL_CRL2_LENGTH                     equ 0001h
TU16ACRL_CRL2_MASK                       equ 0004h
TU16ACRL_CRL3_POSN                       equ 0003h
TU16ACRL_CRL3_POSITION                   equ 0003h
TU16ACRL_CRL3_SIZE                       equ 0001h
TU16ACRL_CRL3_LENGTH                     equ 0001h
TU16ACRL_CRL3_MASK                       equ 0008h
TU16ACRL_CRL4_POSN                       equ 0004h
TU16ACRL_CRL4_POSITION                   equ 0004h
TU16ACRL_CRL4_SIZE                       equ 0001h
TU16ACRL_CRL4_LENGTH                     equ 0001h
TU16ACRL_CRL4_MASK                       equ 0010h
TU16ACRL_CRL5_POSN                       equ 0005h
TU16ACRL_CRL5_POSITION                   equ 0005h
TU16ACRL_CRL5_SIZE                       equ 0001h
TU16ACRL_CRL5_LENGTH                     equ 0001h
TU16ACRL_CRL5_MASK                       equ 0020h
TU16ACRL_CRL6_POSN                       equ 0006h
TU16ACRL_CRL6_POSITION                   equ 0006h
TU16ACRL_CRL6_SIZE                       equ 0001h
TU16ACRL_CRL6_LENGTH                     equ 0001h
TU16ACRL_CRL6_MASK                       equ 0040h
TU16ACRL_CRL7_POSN                       equ 0007h
TU16ACRL_CRL7_POSITION                   equ 0007h
TU16ACRL_CRL7_SIZE                       equ 0001h
TU16ACRL_CRL7_LENGTH                     equ 0001h
TU16ACRL_CRL7_MASK                       equ 0080h
TU16ACRL_TU16ACRL0_POSN                  equ 0000h
TU16ACRL_TU16ACRL0_POSITION              equ 0000h
TU16ACRL_TU16ACRL0_SIZE                  equ 0001h
TU16ACRL_TU16ACRL0_LENGTH                equ 0001h
TU16ACRL_TU16ACRL0_MASK                  equ 0001h
TU16ACRL_TU16ACRL1_POSN                  equ 0001h
TU16ACRL_TU16ACRL1_POSITION              equ 0001h
TU16ACRL_TU16ACRL1_SIZE                  equ 0001h
TU16ACRL_TU16ACRL1_LENGTH                equ 0001h
TU16ACRL_TU16ACRL1_MASK                  equ 0002h
TU16ACRL_TU16ACRL2_POSN                  equ 0002h
TU16ACRL_TU16ACRL2_POSITION              equ 0002h
TU16ACRL_TU16ACRL2_SIZE                  equ 0001h
TU16ACRL_TU16ACRL2_LENGTH                equ 0001h
TU16ACRL_TU16ACRL2_MASK                  equ 0004h
TU16ACRL_TU16ACRL3_POSN                  equ 0003h
TU16ACRL_TU16ACRL3_POSITION              equ 0003h
TU16ACRL_TU16ACRL3_SIZE                  equ 0001h
TU16ACRL_TU16ACRL3_LENGTH                equ 0001h
TU16ACRL_TU16ACRL3_MASK                  equ 0008h
TU16ACRL_TU16ACRL4_POSN                  equ 0004h
TU16ACRL_TU16ACRL4_POSITION              equ 0004h
TU16ACRL_TU16ACRL4_SIZE                  equ 0001h
TU16ACRL_TU16ACRL4_LENGTH                equ 0001h
TU16ACRL_TU16ACRL4_MASK                  equ 0010h
TU16ACRL_TU16ACRL5_POSN                  equ 0005h
TU16ACRL_TU16ACRL5_POSITION              equ 0005h
TU16ACRL_TU16ACRL5_SIZE                  equ 0001h
TU16ACRL_TU16ACRL5_LENGTH                equ 0001h
TU16ACRL_TU16ACRL5_MASK                  equ 0020h
TU16ACRL_TU16ACRL6_POSN                  equ 0006h
TU16ACRL_TU16ACRL6_POSITION              equ 0006h
TU16ACRL_TU16ACRL6_SIZE                  equ 0001h
TU16ACRL_TU16ACRL6_LENGTH                equ 0001h
TU16ACRL_TU16ACRL6_MASK                  equ 0040h
TU16ACRL_TU16ACRL7_POSN                  equ 0007h
TU16ACRL_TU16ACRL7_POSITION              equ 0007h
TU16ACRL_TU16ACRL7_SIZE                  equ 0001h
TU16ACRL_TU16ACRL7_LENGTH                equ 0001h
TU16ACRL_TU16ACRL7_MASK                  equ 0080h
TU16ACRL_TU16ACR0_POSN                   equ 0000h
TU16ACRL_TU16ACR0_POSITION               equ 0000h
TU16ACRL_TU16ACR0_SIZE                   equ 0001h
TU16ACRL_TU16ACR0_LENGTH                 equ 0001h
TU16ACRL_TU16ACR0_MASK                   equ 0001h
TU16ACRL_TU16ACR1_POSN                   equ 0001h
TU16ACRL_TU16ACR1_POSITION               equ 0001h
TU16ACRL_TU16ACR1_SIZE                   equ 0001h
TU16ACRL_TU16ACR1_LENGTH                 equ 0001h
TU16ACRL_TU16ACR1_MASK                   equ 0002h
TU16ACRL_TU16ACR2_POSN                   equ 0002h
TU16ACRL_TU16ACR2_POSITION               equ 0002h
TU16ACRL_TU16ACR2_SIZE                   equ 0001h
TU16ACRL_TU16ACR2_LENGTH                 equ 0001h
TU16ACRL_TU16ACR2_MASK                   equ 0004h
TU16ACRL_TU16ACR3_POSN                   equ 0003h
TU16ACRL_TU16ACR3_POSITION               equ 0003h
TU16ACRL_TU16ACR3_SIZE                   equ 0001h
TU16ACRL_TU16ACR3_LENGTH                 equ 0001h
TU16ACRL_TU16ACR3_MASK                   equ 0008h
TU16ACRL_TU16ACR4_POSN                   equ 0004h
TU16ACRL_TU16ACR4_POSITION               equ 0004h
TU16ACRL_TU16ACR4_SIZE                   equ 0001h
TU16ACRL_TU16ACR4_LENGTH                 equ 0001h
TU16ACRL_TU16ACR4_MASK                   equ 0010h
TU16ACRL_TU16ACR5_POSN                   equ 0005h
TU16ACRL_TU16ACR5_POSITION               equ 0005h
TU16ACRL_TU16ACR5_SIZE                   equ 0001h
TU16ACRL_TU16ACR5_LENGTH                 equ 0001h
TU16ACRL_TU16ACR5_MASK                   equ 0020h
TU16ACRL_TU16ACR6_POSN                   equ 0006h
TU16ACRL_TU16ACR6_POSITION               equ 0006h
TU16ACRL_TU16ACR6_SIZE                   equ 0001h
TU16ACRL_TU16ACR6_LENGTH                 equ 0001h
TU16ACRL_TU16ACR6_MASK                   equ 0040h
TU16ACRL_TU16ACR7_POSN                   equ 0007h
TU16ACRL_TU16ACR7_POSITION               equ 0007h
TU16ACRL_TU16ACR7_SIZE                   equ 0001h
TU16ACRL_TU16ACR7_LENGTH                 equ 0001h
TU16ACRL_TU16ACR7_MASK                   equ 0080h

