GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
#define ANSELC3                          BANKMASK(ANSELC), 3, b
#define ANSELC4                          BANKMASK(ANSELC), 4, b
#define ANSELC5                          BANKMASK(ANSELC), 5, b
#define ANSELC6                          BANKMASK(ANSELC), 6, b
#define ANSELC7                          BANKMASK(ANSELC), 7, b
#define AS                               BANKMASK(SMT1STAT), 0, b
#define ASYNC                            BANKMASK(T0CON1), 4, b
#define BASE0                            BANKMASK(IVTBASEL), 0, b
#define BASE1                            BANKMASK(IVTBASEL), 1, b
#define BASE10                           BANKMASK(IVTBASEH), 2, b
#define BASE11                           BANKMASK(IVTBASEH), 3, b
#define BASE12                           BANKMASK(IVTBASEH), 4, b
#define BASE13                           BANKMASK(IVTBASEH), 5, b
#define BASE14                           BANKMASK(IVTBASEH), 6, b
#define BASE15                           BANKMASK(IVTBASEH), 7, b
#define BASE16                           BANKMASK(IVTBASEU), 0, b
#define BASE17                           BANKMASK(IVTBASEU), 1, b
#define BASE18                           BANKMASK(IVTBASEU), 2, b
#define BASE19                           BANKMASK(IVTBASEU), 3, b
#define BASE2                            BANKMASK(IVTBASEL), 2, b
#define BASE20                           BANKMASK(IVTBASEU), 4, b
#define BASE3                            BANKMASK(IVTBASEL), 3, b
#define BASE4                            BANKMASK(IVTBASEL), 4, b
#define BASE5                            BANKMASK(IVTBASEL), 5, b
#define BASE6                            BANKMASK(IVTBASEL), 6, b
#define BASE7                            BANKMASK(IVTBASEL), 7, b
#define BASE8                            BANKMASK(IVTBASEH), 0, b
#define BASE9                            BANKMASK(IVTBASEH), 1, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCLIE                            BANKMASK(I2C1ERR), 1, b
#define BCLIF                            BANKMASK(I2C1ERR), 5, b
#define BFRE                             BANKMASK(I2C1STAT0), 7, b
#define BFRET0                           BANKMASK(I2C1CON2), 0, b
#define BFRET1                           BANKMASK(I2C1CON2), 1, b
#define BOOTDONE                         BANKMASK(BOOTREG), 6, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BPOUT                            BANKMASK(BOOTREG), 7, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTOC0                            BANKMASK(I2C1BTOC), 0, b
#define BTOC1                            BANKMASK(I2C1BTOC), 1, b
#define BTOC2                            BANKMASK(I2C1BTOC), 2, b
#define BTOC3                            BANKMASK(I2C1BTOC), 3, b
#define BTOIE                            BANKMASK(I2C1ERR), 2, b
#define BTOIF                            BANKMASK(I2C1ERR), 6, b
#define BUF0                             BANKMASK(DMAnBUF), 0, b
#define BUF1                             BANKMASK(DMAnBUF), 1, b
#define BUF2                             BANKMASK(DMAnBUF), 2, b
#define BUF3                             BANKMASK(DMAnBUF), 3, b
#define BUF4                             BANKMASK(DMAnBUF), 4, b
#define BUF5                             BANKMASK(DMAnBUF), 5, b
#define BUF6                             BANKMASK(DMAnBUF), 6, b
#define BUF7                             BANKMASK(DMAnBUF), 7, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE1), 4, a
#define C1IF                             BANKMASK(PIR1), 4, a
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR1), 4, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1OUT                            BANKMASK(CM1CON0), 6, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE14), 2, a
#define C2IF                             BANKMASK(PIR14), 2, a
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR14), 2, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2OUT                            BANKMASK(CM2CON0), 6, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, b
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CANIE                            BANKMASK(PIE0), 6, a
#define CANIF                            BANKMASK(PIR0), 6, a
#define CANIP                            BANKMASK(IPR0), 6, b
#define CANMD                            BANKMASK(PMD2), 7, b
#define CANRXIE                          BANKMASK(PIE4), 4, a
#define CANRXIF                          BANKMASK(PIR4), 4, a
#define CANRXIP                          BANKMASK(IPR4), 4, b
#define CANRXPPS0                        BANKMASK(CANRXPPS), 0, b
#define CANRXPPS1                        BANKMASK(CANRXPPS), 1, b
#define CANRXPPS2                        BANKMASK(CANRXPPS), 2, b
#define CANRXPPS3                        BANKMASK(CANRXPPS), 3, b
#define CANRXPPS4                        BANKMASK(CANRXPPS), 4, b
#define CANTXIE                          BANKMASK(PIE4), 5, a
#define CANTXIF                          BANKMASK(PIR4), 5, a
#define CANTXIP                          BANKMASK(IPR4), 5, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, b
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, b
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, b
#define CCP1CTS3                         BANKMASK(CCP1CAP), 3, b
#define CCP1EN                           BANKMASK(CCP1CON), 7, b
#define CCP1FMT                          BANKMASK(CCP1CON), 4, b
#define CCP1IE                           BANKMASK(PIE3), 6, a
#define CCP1IF                           BANKMASK(PIR3), 6, a
#define CCP1IP                           BANKMASK(IPR3), 6, b
#define CCP1MD                           BANKMASK(PMD5), 0, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, b
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, b
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, b
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, b
#define CCP1OUT                          BANKMASK(CCP1CON), 5, b
#define CCP1PPS0                         BANKMASK(CCP1PPS), 0, b
#define CCP1PPS1                         BANKMASK(CCP1PPS), 1, b
#define CCP1PPS2                         BANKMASK(CCP1PPS), 2, b
#define CCP1PPS3                         BANKMASK(CCP1PPS), 3, b
#define CCP1PPS4                         BANKMASK(CCP1PPS), 4, b
#define CCP1PPS5                         BANKMASK(CCP1PPS), 5, b
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, b
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, b
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, b
#define CCP2CTS3                         BANKMASK(CCP2CAP), 3, b
#define CCP2EN                           BANKMASK(CCP2CON), 7, b
#define CCP2FMT                          BANKMASK(CCP2CON), 4, b
#define CCP2IE                           BANKMASK(PIE8), 6, a
#define CCP2IF                           BANKMASK(PIR8), 6, a
#define CCP2IP                           BANKMASK(IPR8), 6, b
#define CCP2MD                           BANKMASK(PMD5), 1, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, b
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, b
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, b
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, b
#define CCP2OUT                          BANKMASK(CCP2CON), 5, b
#define CCP2PPS0                         BANKMASK(CCP2PPS), 0, b
#define CCP2PPS1                         BANKMASK(CCP2PPS), 1, b
#define CCP2PPS2                         BANKMASK(CCP2PPS), 2, b
#define CCP2PPS3                         BANKMASK(CCP2PPS), 3, b
#define CCP2PPS4                         BANKMASK(CCP2PPS), 4, b
#define CCP2PPS5                         BANKMASK(CCP2PPS), 5, b
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0, b
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1, b
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2, b
#define CCP3CTS3                         BANKMASK(CCP3CAP), 3, b
#define CCP3EN                           BANKMASK(CCP3CON), 7, b
#define CCP3FMT                          BANKMASK(CCP3CON), 4, b
#define CCP3IE                           BANKMASK(PIE11), 0, a
#define CCP3IF                           BANKMASK(PIR11), 0, a
#define CCP3IP                           BANKMASK(IPR11), 0, b
#define CCP3MD                           BANKMASK(PMD5), 2, b
#define CCP3MODE0                        BANKMASK(CCP3CON), 0, b
#define CCP3MODE1                        BANKMASK(CCP3CON), 1, b
#define CCP3MODE2                        BANKMASK(CCP3CON), 2, b
#define CCP3MODE3                        BANKMASK(CCP3CON), 3, b
#define CCP3OUT                          BANKMASK(CCP3CON), 5, b
#define CCP3PPS0                         BANKMASK(CCP3PPS), 0, b
#define CCP3PPS1                         BANKMASK(CCP3PPS), 1, b
#define CCP3PPS2                         BANKMASK(CCP3PPS), 2, b
#define CCP3PPS3                         BANKMASK(CCP3PPS), 3, b
#define CCP3PPS4                         BANKMASK(CCP3PPS), 4, b
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CERRIE                           BANKMASK(C1INTT), 5, b
#define CERRIF                           BANKMASK(C1INTH), 5, b
#define CH0                              BANKMASK(MD1CARH), 0, b
#define CH1                              BANKMASK(MD1CARH), 1, b
#define CH16AB                           BANKMASK(TUCHAIN), 0, b
#define CH2                              BANKMASK(MD1CARH), 2, b
#define CH3                              BANKMASK(MD1CARH), 3, b
#define CH4                              BANKMASK(MD1CARH), 4, b
#define CHPOL                            BANKMASK(MD1CON1), 5, b
#define CHSYNC                           BANKMASK(MD1CON1), 4, b
#define CKPS3                            BANKMASK(T0CON1), 3, b
#define CL0                              BANKMASK(MD1CARL), 0, b
#define CL1                              BANKMASK(MD1CARL), 1, b
#define CL2                              BANKMASK(MD1CARL), 2, b
#define CL3                              BANKMASK(MD1CARL), 3, b
#define CL4                              BANKMASK(MD1CARL), 4, b
#define CLC1IE                           BANKMASK(PIE0), 5, a
#define CLC1IF                           BANKMASK(PIR0), 5, a
#define CLC1IP                           BANKMASK(IPR0), 5, b
#define CLC1MD                           BANKMASK(PMD7), 0, b
#define CLC1OUT                          BANKMASK(CLCDATA), 0, b
#define CLC2IE                           BANKMASK(PIE6), 1, a
#define CLC2IF                           BANKMASK(PIR6), 1, a
#define CLC2IP                           BANKMASK(IPR6), 1, b
#define CLC2MD                           BANKMASK(PMD7), 1, b
#define CLC2OUT                          BANKMASK(CLCDATA), 1, b
#define CLC3IE                           BANKMASK(PIE7), 5, a
#define CLC3IF                           BANKMASK(PIR7), 5, a
#define CLC3IP                           BANKMASK(IPR7), 5, b
#define CLC3MD                           BANKMASK(PMD7), 2, b
#define CLC3OUT                          BANKMASK(CLCDATA), 2, b
#define CLC4IE                           BANKMASK(PIE9), 5, a
#define CLC4IF                           BANKMASK(PIR9), 5, a
#define CLC4IP                           BANKMASK(IPR9), 5, b
#define CLC4MD                           BANKMASK(PMD7), 3, b
#define CLC4OUT                          BANKMASK(CLCDATA), 3, b
#define CLC5IE                           BANKMASK(PIE10), 1, a
#define CLC5IF                           BANKMASK(PIR10), 1, a
#define CLC5IP                           BANKMASK(IPR10), 1, b
#define CLC5MD                           BANKMASK(PMD7), 4, b
#define CLC5OUT                          BANKMASK(CLCDATA), 4, b
#define CLC6IE                           BANKMASK(PIE11), 1, a
#define CLC6IF                           BANKMASK(PIR11), 1, a
#define CLC6IP                           BANKMASK(IPR11), 1, b
#define CLC6MD                           BANKMASK(PMD7), 5, b
#define CLC6OUT                          BANKMASK(CLCDATA), 5, b
#define CLC7IE                           BANKMASK(PIE14), 1, a
#define CLC7IF                           BANKMASK(PIR14), 1, a
#define CLC7IP                           BANKMASK(IPR14), 1, b
#define CLC7MD                           BANKMASK(PMD7), 6, b
#define CLC7OUT                          BANKMASK(CLCDATA), 6, b
#define CLC8IE                           BANKMASK(PIE15), 1, a
#define CLC8IF                           BANKMASK(PIR15), 1, a
#define CLC8IP                           BANKMASK(IPR15), 1, b
#define CLC8MD                           BANKMASK(PMD7), 7, b
#define CLC8OUT                          BANKMASK(CLCDATA), 7, b
#define CLCIN0PPS0                       BANKMASK(CLCIN0PPS), 0, b
#define CLCIN0PPS1                       BANKMASK(CLCIN0PPS), 1, b
#define CLCIN0PPS2                       BANKMASK(CLCIN0PPS), 2, b
#define CLCIN0PPS3                       BANKMASK(CLCIN0PPS), 3, b
#define CLCIN0PPS4                       BANKMASK(CLCIN0PPS), 4, b
#define CLCIN1PPS0                       BANKMASK(CLCIN1PPS), 0, b
#define CLCIN1PPS1                       BANKMASK(CLCIN1PPS), 1, b
#define CLCIN1PPS2                       BANKMASK(CLCIN1PPS), 2, b
#define CLCIN1PPS3                       BANKMASK(CLCIN1PPS), 3, b
#define CLCIN1PPS4                       BANKMASK(CLCIN1PPS), 4, b
#define CLCIN2PPS0                       BANKMASK(CLCIN2PPS), 0, b
#define CLCIN2PPS1                       BANKMASK(CLCIN2PPS), 1, b
#define CLCIN2PPS2                       BANKMASK(CLCIN2PPS), 2, b
#define CLCIN2PPS3                       BANKMASK(CLCIN2PPS), 3, b
#define CLCIN2PPS4                       BANKMASK(CLCIN2PPS), 4, b
#define CLCIN3PPS0                       BANKMASK(CLCIN3PPS), 0, b
#define CLCIN3PPS1                       BANKMASK(CLCIN3PPS), 1, b
#define CLCIN3PPS2                       BANKMASK(CLCIN3PPS), 2, b
#define CLCIN3PPS3                       BANKMASK(CLCIN3PPS), 3, b
#define CLCIN3PPS4                       BANKMASK(CLCIN3PPS), 4, b
#define CLCIN4PPS0                       BANKMASK(CLCIN4PPS), 0, b
#define CLCIN4PPS1                       BANKMASK(CLCIN4PPS), 1, b
#define CLCIN4PPS2                       BANKMASK(CLCIN4PPS), 2, b
#define CLCIN4PPS3                       BANKMASK(CLCIN4PPS), 3, b
#define CLCIN4PPS4                       BANKMASK(CLCIN4PPS), 4, b
#define CLCIN5PPS0                       BANKMASK(CLCIN5PPS), 0, b
#define CLCIN5PPS1                       BANKMASK(CLCIN5PPS), 1, b
#define CLCIN5PPS2                       BANKMASK(CLCIN5PPS), 2, b
#define CLCIN5PPS3                       BANKMASK(CLCIN5PPS), 3, b
#define CLCIN5PPS4                       BANKMASK(CLCIN5PPS), 4, b
#define CLCIN6PPS0                       BANKMASK(CLCIN6PPS), 0, b
#define CLCIN6PPS1                       BANKMASK(CLCIN6PPS), 1, b
#define CLCIN6PPS2                       BANKMASK(CLCIN6PPS), 2, b
#define CLCIN6PPS3                       BANKMASK(CLCIN6PPS), 3, b
#define CLCIN6PPS4                       BANKMASK(CLCIN6PPS), 4, b
#define CLCIN7PPS0                       BANKMASK(CLCIN7PPS), 0, b
#define CLCIN7PPS1                       BANKMASK(CLCIN7PPS), 1, b
#define CLCIN7PPS2                       BANKMASK(CLCIN7PPS), 2, b
#define CLCIN7PPS3                       BANKMASK(CLCIN7PPS), 3, b
#define CLCIN7PPS4                       BANKMASK(CLCIN7PPS), 4, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRCLK4                         BANKMASK(CLKRCLK), 4, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLPOL                            BANKMASK(MD1CON1), 1, b
#define CLSYNC                           BANKMASK(MD1CON1), 0, b
#define CM1MD                            BANKMASK(PMD3), 1, b
#define CM2MD                            BANKMASK(PMD3), 2, b
#define CNT10                            BANKMASK(I2C1CNTH), 2, b
#define CNT11                            BANKMASK(I2C1CNTH), 3, b
#define CNT12                            BANKMASK(I2C1CNTH), 4, b
#define CNT13                            BANKMASK(I2C1CNTH), 5, b
#define CNT14                            BANKMASK(I2C1CNTH), 6, b
#define CNT15                            BANKMASK(I2C1CNTH), 7, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT8                             BANKMASK(I2C1CNTH), 0, b
#define CNT9                             BANKMASK(I2C1CNTH), 1, b
#define CNTIE                            BANKMASK(I2C1PIE), 7, b
#define CNTIF                            BANKMASK(I2C1PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CPON                             BANKMASK(ADCPCON), 7, b
#define CPR0                             BANKMASK(SMT1CPRL), 0, b
#define CPR1                             BANKMASK(SMT1CPRL), 1, b
#define CPR10                            BANKMASK(SMT1CPRH), 2, b
#define CPR11                            BANKMASK(SMT1CPRH), 3, b
#define CPR12                            BANKMASK(SMT1CPRH), 4, b
#define CPR13                            BANKMASK(SMT1CPRH), 5, b
#define CPR14                            BANKMASK(SMT1CPRH), 6, b
#define CPR15                            BANKMASK(SMT1CPRH), 7, b
#define CPR16                            BANKMASK(SMT1CPRU), 0, b
#define CPR17                            BANKMASK(SMT1CPRU), 1, b
#define CPR18                            BANKMASK(SMT1CPRU), 2, b
#define CPR19                            BANKMASK(SMT1CPRU), 3, b
#define CPR2                             BANKMASK(SMT1CPRL), 2, b
#define CPR20                            BANKMASK(SMT1CPRU), 4, b
#define CPR21                            BANKMASK(SMT1CPRU), 5, b
#define CPR22                            BANKMASK(SMT1CPRU), 6, b
#define CPR23                            BANKMASK(SMT1CPRU), 7, b
#define CPR3                             BANKMASK(SMT1CPRL), 3, b
#define CPR4                             BANKMASK(SMT1CPRL), 4, b
#define CPR5                             BANKMASK(SMT1CPRL), 5, b
#define CPR6                             BANKMASK(SMT1CPRL), 6, b
#define CPR7                             BANKMASK(SMT1CPRL), 7, b
#define CPR8                             BANKMASK(SMT1CPRH), 0, b
#define CPR9                             BANKMASK(SMT1CPRH), 1, b
#define CPRDY                            BANKMASK(ADCPCON), 0, b
#define CPRUP                            BANKMASK(SMT1STAT), 7, b
#define CPW0                             BANKMASK(SMT1CPWL), 0, b
#define CPW1                             BANKMASK(SMT1CPWL), 1, b
#define CPW10                            BANKMASK(SMT1CPWH), 2, b
#define CPW11                            BANKMASK(SMT1CPWH), 3, b
#define CPW12                            BANKMASK(SMT1CPWH), 4, b
#define CPW13                            BANKMASK(SMT1CPWH), 5, b
#define CPW14                            BANKMASK(SMT1CPWH), 6, b
#define CPW15                            BANKMASK(SMT1CPWH), 7, b
#define CPW16                            BANKMASK(SMT1CPWU), 0, b
#define CPW17                            BANKMASK(SMT1CPWU), 1, b
#define CPW18                            BANKMASK(SMT1CPWU), 2, b
#define CPW19                            BANKMASK(SMT1CPWU), 3, b
#define CPW2                             BANKMASK(SMT1CPWL), 2, b
#define CPW20                            BANKMASK(SMT1CPWU), 4, b
#define CPW21                            BANKMASK(SMT1CPWU), 5, b
#define CPW22                            BANKMASK(SMT1CPWU), 6, b
#define CPW23                            BANKMASK(SMT1CPWU), 7, b
#define CPW3                             BANKMASK(SMT1CPWL), 3, b
#define CPW4                             BANKMASK(SMT1CPWL), 4, b
#define CPW5                             BANKMASK(SMT1CPWL), 5, b
#define CPW6                             BANKMASK(SMT1CPWL), 6, b
#define CPW7                             BANKMASK(SMT1CPWL), 7, b
#define CPW8                             BANKMASK(SMT1CPWH), 0, b
#define CPW9                             BANKMASK(SMT1CPWH), 1, b
#define CPWUP                            BANKMASK(SMT1STAT), 6, b
#define CRCBUSY                          BANKMASK(CRCCON0), 5, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE15), 2, a
#define CRCIF                            BANKMASK(PIR15), 2, a
#define CRCIP                            BANKMASK(IPR15), 2, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
