GopalSaraf/Practicals/PSDL/include/proc/pic18f26q83.inc
#define TDCV4                            BANKMASK(C1TDCL), 4, b
#define TDCV5                            BANKMASK(C1TDCL), 5, b
#define TEFFIE                           BANKMASK(C1TEFCONL), 2, b
#define TEFFIF                           BANKMASK(C1TEFSTAL), 2, b
#define TEFHIE                           BANKMASK(C1TEFCONL), 1, b
#define TEFHIF                           BANKMASK(C1TEFSTAL), 1, b
#define TEFIE                            BANKMASK(C1INTU), 4, b
#define TEFIF                            BANKMASK(C1INTL), 4, b
#define TEFNEIE                          BANKMASK(C1TEFCONL), 0, b
#define TEFNEIF                          BANKMASK(C1TEFSTAL), 0, b
#define TEFOVIE                          BANKMASK(C1TEFCONL), 3, b
#define TEFOVIF                          BANKMASK(C1TEFSTAL), 3, b
#define TEFTSEN                          BANKMASK(C1TEFCONL), 5, b
#define TEFUA0                           BANKMASK(C1TEFUAL), 0, b
#define TEFUA1                           BANKMASK(C1TEFUAL), 1, b
#define TEFUA10                          BANKMASK(C1TEFUAH), 2, b
#define TEFUA11                          BANKMASK(C1TEFUAH), 3, b
#define TEFUA12                          BANKMASK(C1TEFUAH), 4, b
#define TEFUA13                          BANKMASK(C1TEFUAH), 5, b
#define TEFUA14                          BANKMASK(C1TEFUAH), 6, b
#define TEFUA15                          BANKMASK(C1TEFUAH), 7, b
#define TEFUA16                          BANKMASK(C1TEFUAU), 0, b
#define TEFUA17                          BANKMASK(C1TEFUAU), 1, b
#define TEFUA18                          BANKMASK(C1TEFUAU), 2, b
#define TEFUA19                          BANKMASK(C1TEFUAU), 3, b
#define TEFUA2                           BANKMASK(C1TEFUAL), 2, b
#define TEFUA20                          BANKMASK(C1TEFUAU), 4, b
#define TEFUA21                          BANKMASK(C1TEFUAU), 5, b
#define TEFUA22                          BANKMASK(C1TEFUAU), 6, b
#define TEFUA23                          BANKMASK(C1TEFUAU), 7, b
#define TEFUA24                          BANKMASK(C1TEFUAT), 0, b
#define TEFUA25                          BANKMASK(C1TEFUAT), 1, b
#define TEFUA26                          BANKMASK(C1TEFUAT), 2, b
#define TEFUA27                          BANKMASK(C1TEFUAT), 3, b
#define TEFUA28                          BANKMASK(C1TEFUAT), 4, b
#define TEFUA29                          BANKMASK(C1TEFUAT), 5, b
#define TEFUA3                           BANKMASK(C1TEFUAL), 3, b
#define TEFUA30                          BANKMASK(C1TEFUAT), 6, b
#define TEFUA31                          BANKMASK(C1TEFUAT), 7, b
#define TEFUA4                           BANKMASK(C1TEFUAL), 4, b
#define TEFUA5                           BANKMASK(C1TEFUAL), 5, b
#define TEFUA6                           BANKMASK(C1TEFUAL), 6, b
#define TEFUA7                           BANKMASK(C1TEFUAL), 7, b
#define TEFUA8                           BANKMASK(C1TEFUAH), 0, b
#define TEFUA9                           BANKMASK(C1TEFUAH), 1, b
#define TERRCNT0                         BANKMASK(C1TRECH), 0, b
#define TERRCNT1                         BANKMASK(C1TRECH), 1, b
#define TERRCNT2                         BANKMASK(C1TRECH), 2, b
#define TERRCNT3                         BANKMASK(C1TRECH), 3, b
#define TERRCNT4                         BANKMASK(C1TRECH), 4, b
#define TERRCNT5                         BANKMASK(C1TRECH), 5, b
#define TERRCNT6                         BANKMASK(C1TRECH), 6, b
#define TERRCNT7                         BANKMASK(C1TRECH), 7, b
#define TFATIF0                          BANKMASK(C1TXATIFL), 0, b
#define TFATIF1                          BANKMASK(C1TXATIFL), 1, b
#define TFATIF10                         BANKMASK(C1TXATIFH), 2, b
#define TFATIF11                         BANKMASK(C1TXATIFH), 3, b
#define TFATIF12                         BANKMASK(C1TXATIFH), 4, b
#define TFATIF13                         BANKMASK(C1TXATIFH), 5, b
#define TFATIF14                         BANKMASK(C1TXATIFH), 6, b
#define TFATIF15                         BANKMASK(C1TXATIFH), 7, b
#define TFATIF16                         BANKMASK(C1TXATIFU), 0, b
#define TFATIF17                         BANKMASK(C1TXATIFU), 1, b
#define TFATIF18                         BANKMASK(C1TXATIFU), 2, b
#define TFATIF19                         BANKMASK(C1TXATIFU), 3, b
#define TFATIF2                          BANKMASK(C1TXATIFL), 2, b
#define TFATIF20                         BANKMASK(C1TXATIFU), 4, b
#define TFATIF21                         BANKMASK(C1TXATIFU), 5, b
#define TFATIF22                         BANKMASK(C1TXATIFU), 6, b
#define TFATIF23                         BANKMASK(C1TXATIFU), 7, b
#define TFATIF24                         BANKMASK(C1TXATIFT), 0, b
#define TFATIF25                         BANKMASK(C1TXATIFT), 1, b
#define TFATIF26                         BANKMASK(C1TXATIFT), 2, b
#define TFATIF27                         BANKMASK(C1TXATIFT), 3, b
#define TFATIF28                         BANKMASK(C1TXATIFT), 4, b
#define TFATIF29                         BANKMASK(C1TXATIFT), 5, b
#define TFATIF3                          BANKMASK(C1TXATIFL), 3, b
#define TFATIF30                         BANKMASK(C1TXATIFT), 6, b
#define TFATIF31                         BANKMASK(C1TXATIFT), 7, b
#define TFATIF4                          BANKMASK(C1TXATIFL), 4, b
#define TFATIF5                          BANKMASK(C1TXATIFL), 5, b
#define TFATIF6                          BANKMASK(C1TXATIFL), 6, b
#define TFATIF7                          BANKMASK(C1TXATIFL), 7, b
#define TFATIF8                          BANKMASK(C1TXATIFH), 0, b
#define TFATIF9                          BANKMASK(C1TXATIFH), 1, b
#define TFIF0                            BANKMASK(C1TXIFL), 0, b
#define TFIF1                            BANKMASK(C1TXIFL), 1, b
#define TFIF10                           BANKMASK(C1TXIFH), 2, b
#define TFIF11                           BANKMASK(C1TXIFH), 3, b
#define TFIF12                           BANKMASK(C1TXIFH), 4, b
#define TFIF13                           BANKMASK(C1TXIFH), 5, b
#define TFIF14                           BANKMASK(C1TXIFH), 6, b
#define TFIF15                           BANKMASK(C1TXIFH), 7, b
#define TFIF16                           BANKMASK(C1TXIFU), 0, b
#define TFIF17                           BANKMASK(C1TXIFU), 1, b
#define TFIF18                           BANKMASK(C1TXIFU), 2, b
#define TFIF19                           BANKMASK(C1TXIFU), 3, b
#define TFIF2                            BANKMASK(C1TXIFL), 2, b
#define TFIF20                           BANKMASK(C1TXIFU), 4, b
#define TFIF21                           BANKMASK(C1TXIFU), 5, b
#define TFIF22                           BANKMASK(C1TXIFU), 6, b
#define TFIF23                           BANKMASK(C1TXIFU), 7, b
#define TFIF24                           BANKMASK(C1TXIFT), 0, b
#define TFIF25                           BANKMASK(C1TXIFT), 1, b
#define TFIF26                           BANKMASK(C1TXIFT), 2, b
#define TFIF27                           BANKMASK(C1TXIFT), 3, b
#define TFIF28                           BANKMASK(C1TXIFT), 4, b
#define TFIF29                           BANKMASK(C1TXIFT), 5, b
#define TFIF3                            BANKMASK(C1TXIFL), 3, b
#define TFIF30                           BANKMASK(C1TXIFT), 6, b
#define TFIF31                           BANKMASK(C1TXIFT), 7, b
#define TFIF4                            BANKMASK(C1TXIFL), 4, b
#define TFIF5                            BANKMASK(C1TXIFL), 5, b
#define TFIF6                            BANKMASK(C1TXIFL), 6, b
#define TFIF7                            BANKMASK(C1TXIFL), 7, b
#define TFIF8                            BANKMASK(C1TXIFH), 0, b
#define TFIF9                            BANKMASK(C1TXIFH), 1, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0                             BANKMASK(SMT1TMRL), 0, b
#define TMR0H0                           BANKMASK(TMR0H), 0, b
#define TMR0H1                           BANKMASK(TMR0H), 1, b
#define TMR0H2                           BANKMASK(TMR0H), 2, b
#define TMR0H3                           BANKMASK(TMR0H), 3, b
#define TMR0H4                           BANKMASK(TMR0H), 4, b
#define TMR0H5                           BANKMASK(TMR0H), 5, b
#define TMR0H6                           BANKMASK(TMR0H), 6, b
#define TMR0H7                           BANKMASK(TMR0H), 7, b
#define TMR0IE                           BANKMASK(PIE3), 7, a
#define TMR0IF                           BANKMASK(PIR3), 7, a
#define TMR0IP                           BANKMASK(IPR3), 7, b
#define TMR0L0                           BANKMASK(TMR0L), 0, b
#define TMR0L1                           BANKMASK(TMR0L), 1, b
#define TMR0L2                           BANKMASK(TMR0L), 2, b
#define TMR0L3                           BANKMASK(TMR0L), 3, b
#define TMR0L4                           BANKMASK(TMR0L), 4, b
#define TMR0L5                           BANKMASK(TMR0L), 5, b
#define TMR0L6                           BANKMASK(TMR0L), 6, b
#define TMR0L7                           BANKMASK(TMR0L), 7, b
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR1                             BANKMASK(SMT1TMRL), 1, b
#define TMR10                            BANKMASK(SMT1TMRH), 2, b
#define TMR11                            BANKMASK(SMT1TMRH), 3, b
#define TMR12                            BANKMASK(SMT1TMRH), 4, b
#define TMR13                            BANKMASK(SMT1TMRH), 5, b
#define TMR14                            BANKMASK(SMT1TMRH), 6, b
#define TMR15                            BANKMASK(SMT1TMRH), 7, b
#define TMR16                            BANKMASK(SMT1TMRU), 0, b
#define TMR17                            BANKMASK(SMT1TMRU), 1, b
#define TMR18                            BANKMASK(SMT1TMRU), 2, b
#define TMR19                            BANKMASK(SMT1TMRU), 3, b
#define TMR1GIE                          BANKMASK(PIE3), 5, a
#define TMR1GIF                          BANKMASK(PIR3), 5, a
#define TMR1GIP                          BANKMASK(IPR3), 5, b
#define TMR1H0                           BANKMASK(TMR1H), 0, b
#define TMR1H1                           BANKMASK(TMR1H), 1, b
#define TMR1H2                           BANKMASK(TMR1H), 2, b
#define TMR1H3                           BANKMASK(TMR1H), 3, b
#define TMR1H4                           BANKMASK(TMR1H), 4, b
#define TMR1H5                           BANKMASK(TMR1H), 5, b
#define TMR1H6                           BANKMASK(TMR1H), 6, b
#define TMR1H7                           BANKMASK(TMR1H), 7, b
#define TMR1IE                           BANKMASK(PIE3), 4, a
#define TMR1IF                           BANKMASK(PIR3), 4, a
#define TMR1IP                           BANKMASK(IPR3), 4, b
#define TMR1L0                           BANKMASK(TMR1L), 0, b
#define TMR1L1                           BANKMASK(TMR1L), 1, b
#define TMR1L2                           BANKMASK(TMR1L), 2, b
#define TMR1L3                           BANKMASK(TMR1L), 3, b
#define TMR1L4                           BANKMASK(TMR1L), 4, b
#define TMR1L5                           BANKMASK(TMR1L), 5, b
#define TMR1L6                           BANKMASK(TMR1L), 6, b
#define TMR1L7                           BANKMASK(TMR1L), 7, b
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, b
#define TMR2                             BANKMASK(SMT1TMRL), 2, b
#define TMR20                            BANKMASK(SMT1TMRU), 4, b
#define TMR21                            BANKMASK(SMT1TMRU), 5, b
#define TMR22                            BANKMASK(SMT1TMRU), 6, b
#define TMR23                            BANKMASK(SMT1TMRU), 7, b
#define TMR2IE                           BANKMASK(PIE3), 3, a
#define TMR2IF                           BANKMASK(PIR3), 3, a
#define TMR2IP                           BANKMASK(IPR3), 3, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, b
#define TMR3                             BANKMASK(SMT1TMRL), 3, b
#define TMR3GIE                          BANKMASK(PIE5), 5, a
#define TMR3GIF                          BANKMASK(PIR5), 5, a
#define TMR3GIP                          BANKMASK(IPR5), 5, b
#define TMR3H0                           BANKMASK(TMR3H), 0, b
#define TMR3H1                           BANKMASK(TMR3H), 1, b
#define TMR3H2                           BANKMASK(TMR3H), 2, b
#define TMR3H3                           BANKMASK(TMR3H), 3, b
#define TMR3H4                           BANKMASK(TMR3H), 4, b
#define TMR3H5                           BANKMASK(TMR3H), 5, b
#define TMR3H6                           BANKMASK(TMR3H), 6, b
#define TMR3H7                           BANKMASK(TMR3H), 7, b
#define TMR3IE                           BANKMASK(PIE5), 4, a
#define TMR3IF                           BANKMASK(PIR5), 4, a
#define TMR3IP                           BANKMASK(IPR5), 4, b
#define TMR3L0                           BANKMASK(TMR3L), 0, b
#define TMR3L1                           BANKMASK(TMR3L), 1, b
#define TMR3L2                           BANKMASK(TMR3L), 2, b
#define TMR3L3                           BANKMASK(TMR3L), 3, b
#define TMR3L4                           BANKMASK(TMR3L), 4, b
#define TMR3L5                           BANKMASK(TMR3L), 5, b
#define TMR3L6                           BANKMASK(TMR3L), 6, b
#define TMR3L7                           BANKMASK(TMR3L), 7, b
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, b
#define TMR4                             BANKMASK(SMT1TMRL), 4, b
#define TMR4IE                           BANKMASK(PIE11), 3, a
#define TMR4IF                           BANKMASK(PIR11), 3, a
#define TMR4IP                           BANKMASK(IPR11), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, b
#define TMR5                             BANKMASK(SMT1TMRL), 5, b
#define TMR5GIE                          BANKMASK(PIE8), 5, a
#define TMR5GIF                          BANKMASK(PIR8), 5, a
#define TMR5GIP                          BANKMASK(IPR8), 5, b
#define TMR5H0                           BANKMASK(TMR5H), 0, b
#define TMR5H1                           BANKMASK(TMR5H), 1, b
#define TMR5H2                           BANKMASK(TMR5H), 2, b
#define TMR5H3                           BANKMASK(TMR5H), 3, b
#define TMR5H4                           BANKMASK(TMR5H), 4, b
#define TMR5H5                           BANKMASK(TMR5H), 5, b
#define TMR5H6                           BANKMASK(TMR5H), 6, b
#define TMR5H7                           BANKMASK(TMR5H), 7, b
#define TMR5IE                           BANKMASK(PIE8), 4, a
#define TMR5IF                           BANKMASK(PIR8), 4, a
#define TMR5IP                           BANKMASK(IPR8), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, b
#define TMR5L1                           BANKMASK(TMR5L), 1, b
#define TMR5L2                           BANKMASK(TMR5L), 2, b
#define TMR5L3                           BANKMASK(TMR5L), 3, b
#define TMR5L4                           BANKMASK(TMR5L), 4, b
#define TMR5L5                           BANKMASK(TMR5L), 5, b
#define TMR5L6                           BANKMASK(TMR5L), 6, b
#define TMR5L7                           BANKMASK(TMR5L), 7, b
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, b
#define TMR6                             BANKMASK(SMT1TMRL), 6, b
#define TMR6IE                           BANKMASK(PIE15), 3, a
#define TMR6IF                           BANKMASK(PIR15), 3, a
#define TMR6IP                           BANKMASK(IPR15), 3, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, b
#define TMR7                             BANKMASK(SMT1TMRL), 7, b
#define TMR8                             BANKMASK(SMT1TMRH), 0, b
#define TMR9                             BANKMASK(SMT1TMRH), 1, b
#define TMRAOSEN                         BANKMASK(TU16ACON1), 6, b
#define TMRBOSEN                         BANKMASK(TU16BCON1), 6, b
#define TOBY32                           BANKMASK(I2C1BTO), 6, b
#define TOREC                            BANKMASK(I2C1BTO), 7, b
#define TOTIME0                          BANKMASK(I2C1BTO), 0, b
#define TOTIME1                          BANKMASK(I2C1BTO), 1, b
#define TOTIME2                          BANKMASK(I2C1BTO), 2, b
#define TOTIME3                          BANKMASK(I2C1BTO), 3, b
#define TOTIME4                          BANKMASK(I2C1BTO), 4, b
#define TOTIME5                          BANKMASK(I2C1BTO), 5, b
#define TRIGEN                           BANKMASK(SCANCON0), 6, b
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISE3                           BANKMASK(TRISE), 3, a
#define TS                               BANKMASK(SMT1STAT), 2, b
#define TSEG15                           BANKMASK(C1NBTCFGU), 5, b
#define TSEG16                           BANKMASK(C1NBTCFGU), 6, b
#define TSEG17                           BANKMASK(C1NBTCFGU), 7, b
#define TSEG24                           BANKMASK(C1NBTCFGH), 4, b
#define TSEG25                           BANKMASK(C1NBTCFGH), 5, b
#define TSEG26                           BANKMASK(C1NBTCFGH), 6, b
#define TSEL0                            BANKMASK(SCANTRIG), 0, b
#define TSEL1                            BANKMASK(SCANTRIG), 1, b
#define TSEL2                            BANKMASK(SCANTRIG), 2, b
#define TSEL3                            BANKMASK(SCANTRIG), 3, b
#define TSEL4                            BANKMASK(SCANTRIG), 4, b
#define TSEN                             BANKMASK(FVRCON), 5, b
#define TSEOF                            BANKMASK(C1TSCONU), 1, b
#define TSRNG                            BANKMASK(FVRCON), 4, b
#define TU16ACAPT                        BANKMASK(TU16ACON1), 3, b
#define TU16ACIE                         BANKMASK(TU16ACON0), 0, b
#define TU16ACIF                         BANKMASK(TU16ACON1), 0, b
#define TU16ACLK0                        BANKMASK(TU16ACLK), 0, b
#define TU16ACLK1                        BANKMASK(TU16ACLK), 1, b
#define TU16ACLK2                        BANKMASK(TU16ACLK), 2, b
#define TU16ACLK3                        BANKMASK(TU16ACLK), 3, b
#define TU16ACLK4                        BANKMASK(TU16ACLK), 4, b
#define TU16ACLR                         BANKMASK(TU16ACON1), 5, b
#define TU16ACPOL                        BANKMASK(TU16ACON0), 6, b
#define TU16ACR0                         BANKMASK(TU16ACRL), 0, b
#define TU16ACR1                         BANKMASK(TU16ACRL), 1, b
#define TU16ACR10                        BANKMASK(TU16ACRH), 2, b
#define TU16ACR11                        BANKMASK(TU16ACRH), 3, b
#define TU16ACR12                        BANKMASK(TU16ACRH), 4, b
#define TU16ACR13                        BANKMASK(TU16ACRH), 5, b
#define TU16ACR14                        BANKMASK(TU16ACRH), 6, b
#define TU16ACR15                        BANKMASK(TU16ACRH), 7, b
#define TU16ACR2                         BANKMASK(TU16ACRL), 2, b
#define TU16ACR3                         BANKMASK(TU16ACRL), 3, b
#define TU16ACR4                         BANKMASK(TU16ACRL), 4, b
#define TU16ACR5                         BANKMASK(TU16ACRL), 5, b
#define TU16ACR6                         BANKMASK(TU16ACRL), 6, b
#define TU16ACR7                         BANKMASK(TU16ACRL), 7, b
#define TU16ACR8                         BANKMASK(TU16ACRH), 0, b
#define TU16ACR9                         BANKMASK(TU16ACRH), 1, b
#define TU16ACRH0                        BANKMASK(TU16ACRH), 0, b
#define TU16ACRH1                        BANKMASK(TU16ACRH), 1, b
#define TU16ACRH2                        BANKMASK(TU16ACRH), 2, b
#define TU16ACRH3                        BANKMASK(TU16ACRH), 3, b
#define TU16ACRH4                        BANKMASK(TU16ACRH), 4, b
#define TU16ACRH5                        BANKMASK(TU16ACRH), 5, b
#define TU16ACRH6                        BANKMASK(TU16ACRH), 6, b
#define TU16ACRH7                        BANKMASK(TU16ACRH), 7, b
#define TU16ACRL0                        BANKMASK(TU16ACRL), 0, b
#define TU16ACRL1                        BANKMASK(TU16ACRL), 1, b
#define TU16ACRL2                        BANKMASK(TU16ACRL), 2, b
#define TU16ACRL3                        BANKMASK(TU16ACRL), 3, b
#define TU16ACRL4                        BANKMASK(TU16ACRL), 4, b
#define TU16ACRL5                        BANKMASK(TU16ACRL), 5, b
#define TU16ACRL6                        BANKMASK(TU16ACRL), 6, b
#define TU16ACRL7                        BANKMASK(TU16ACRL), 7, b
#define TU16ACSYNC                       BANKMASK(TU16AHLT), 6, b
#define TU16AEPOL                        BANKMASK(TU16AHLT), 7, b
#define TU16AERS0                        BANKMASK(TU16AERS), 0, b
#define TU16AERS1                        BANKMASK(TU16AERS), 1, b
#define TU16AERS2                        BANKMASK(TU16AERS), 2, b
#define TU16AERS3                        BANKMASK(TU16AERS), 3, b
#define TU16AERS4                        BANKMASK(TU16AERS), 4, b
#define TU16AERS5                        BANKMASK(TU16AERS), 5, b
#define TU16AIE                          BANKMASK(PIE0), 4, a
#define TU16AIF                          BANKMASK(PIR0), 4, a
#define TU16AIP                          BANKMASK(IPR0), 4, b
#define TU16ALIMIT                       BANKMASK(TU16ACON1), 4, b
#define TU16AMD                          BANKMASK(PMD2), 0, b
#define TU16AOM                          BANKMASK(TU16ACON0), 5, b
#define TU16AON                          BANKMASK(TU16ACON0), 7, b
#define TU16AOPOL                        BANKMASK(TU16ACON0), 4, b
#define TU16APR0                         BANKMASK(TU16APRL), 0, b
#define TU16APR1                         BANKMASK(TU16APRL), 1, b
#define TU16APR10                        BANKMASK(TU16APRH), 2, b
#define TU16APR11                        BANKMASK(TU16APRH), 3, b
#define TU16APR12                        BANKMASK(TU16APRH), 4, b
#define TU16APR13                        BANKMASK(TU16APRH), 5, b
#define TU16APR14                        BANKMASK(TU16APRH), 6, b
#define TU16APR15                        BANKMASK(TU16APRH), 7, b
#define TU16APR2                         BANKMASK(TU16APRL), 2, b
#define TU16APR3                         BANKMASK(TU16APRL), 3, b
